#include "Main.h"
#include "Texture_Class.h"

/*===================================================
//	メイン処理
//	引数	一つ前の遷移クラスのポインタが渡される
//	戻値	遷移する場合、次に移る遷移先アドレスを渡す
===================================================*/
cGameTrans* MainLoop::update(cGameTrans* Parent){
	/*=====================メイン処理を書いて============================*/
	cGameTrans* next = pTrans->update(this);	//更新処理と次に実行する処理を取得する

	//次に実行する処理と現存処理が異なればdelete
	if (next != pTrans){
		delete pTrans;
		pTrans = next;
		next = nullptr;
	}
	else{
		//描画処理
		pTrans->DrawBegine();
		pTrans->draw();
		pTrans->DrawEnd();
	}
	
	return this;	//状態遷移がなければ自分を返す
}

/*===================================================
//	描画処理
//	描画機能をここに書き込み、Updateで呼び出せばOK
===================================================*/
void MainLoop::draw(){
	DrawBegine();	//あらかじめBegineと…

	/*=================描画処理===================*/


	/*===========================================*/

	DrawEnd();		//Endを書いておくとその間に処理を書けば済むよ！
}

/*===================================================
//	初期化処理
//	ゲーム中で使用する変数はヘッダーで定義しここで初期化
===================================================*/
MainLoop::MainLoop(){
	//スタートはタイトルから
	//pTrans = new Title();
	//pTrans = new MainGame;
	pTrans = new cCurtain;
	//pTrans = new clear;
}

/*===================================================
//	解放処理
//	ゲーム中で使用した変数はきっちり後片付けしましょうね！
===================================================*/
MainLoop::~MainLoop(){
	delete pTrans;
	pTrans = nullptr;
}