#include "Main.h"
#include "Debug.h"
#include "Input.h"

/*===================================================
//	メイン処理
//	引数	一つ前の遷移クラスのポインタが渡される
//	戻値	遷移する場合、次に移る遷移先アドレスを渡す
===================================================*/
cGameTrans* MainLoop::update(cGameTrans* Parent){
	/*=====================メイン処理を書いて============================*/
	//GetConsole->SetPos(0, 0);
	GetConsole->Clear();
	GetConsole->SetColor(BLACK, CORAL);
	D_printf("もののけ姫\n");
	if (GetKey->Press(DIK_RETURN))
		D_printf("紅の豚");
	draw();
	return this;	//状態遷移がなければ自分を返す
}

/*===================================================
//	描画処理
//	描画機能をここに書き込み、Updateで呼び出せばOK
===================================================*/
void MainLoop::draw(){
	DrawBegine();	//あらかじめBegineと…

	/*=================描画処理===================*/
	
	/*===========================================*/

	DrawEnd();		//Endを書いておくとその間に処理を書けば済むよ！
}

/*===================================================
//	初期化処理
//	ゲーム中で使用する変数はヘッダーで定義しここで初期化
===================================================*/
MainLoop::MainLoop(){
	
}

/*===================================================
//	解放処理
//	ゲーム中で使用した変数はきっちり後片付けしましょうね！
===================================================*/
MainLoop::~MainLoop(){
	
}