/*=========================================================//
//		概要	:	ゲームシステムなどを記述する
//					作成者　松本 雄之介 (AT12A606)
//						作成日	2016/11/2
//					  更新日
//
//=========================================================*/
#ifndef INC_MAIN_SYSTEM_H
#define INC_MAIN_SYSTEM_H

/*=======================マクロ定義========================*/
/* ここに記述するものはディスプレイサイズやフレームレートなどのゲームシステムを決定するもののみ */

#define WINDOW_SCREEN_X		(1280)									//ウィンドウサイズ
#define WINDOW_SCREEN_Y		(720)
#define PROGRAM_TITLE			("ダース・インベーダー")		//プログラム名
#define FRAME_RATE (60)													//フレームレート

#endif